#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Wed Feb  8 18:52:29 2023

set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_rx_tx
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_rx_tx
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "C:/Users/w/Desktop/MES50HP/2_demo/07_hdmi_loop/src/hdmi_loop.fdc"
remove_constraint  -logic -fdc "C:/Users/w/Desktop/MES50HP/2_demo/07_hdmi_loop/src/hdmi_rx_tx.fdc"
add_design "C:/Users/w/Desktop/MES50HP/2_demo/07_hdmi_loop/src/hdmi_loop.v"
remove_design -verilog "C:/Users/w/Desktop/MES50HP/2_demo/07_hdmi_loop/src/hdmi_rx_tx.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design G:/BaiduNetdiskDownload/06_hdmi_loop/06_hdmi_loop/ipcore/pcie_trans/pcie_trans.idf
add_design G:/BaiduNetdiskDownload/06_hdmi_loop/06_hdmi_loop/ipcore/i_24_128_o_128/i_24_128_o_128.idf
remove_design G:/BaiduNetdiskDownload/06_hdmi_loop/06_hdmi_loop/ipcore/i_24_128_o_128/i_24_128_o_128.idf
add_design G:/BaiduNetdiskDownload/06_hdmi_loop/06_hdmi_loop/ipcore/i_16_128_o_128_16_fifo/i_16_128_o_128_16_fifo.idf
remove_design G:/BaiduNetdiskDownload/06_hdmi_loop/06_hdmi_loop/ipcore/i_16_128_o_128_16_fifo/i_16_128_o_128_16_fifo.idf
add_design G:/BaiduNetdiskDownload/06_hdmi_loop/06_hdmi_loop/ipcore/i_16_128_o_128_16/i_16_128_o_128_16.idf
add_design "G:/BaiduNetdiskDownload/06_hdmi_loop/06_hdmi_loop/src/dma_ctrl.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
add_fic "G:/BaiduNetdiskDownload/06_hdmi_loop/06_hdmi_loop/synthesize/hdmi_loop_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/camera_delay.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/eth_trans.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/voice_trans_cache.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/mac/arp_cache.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/mac/crc.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/mac/dpram.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/mac/icmp_reply.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/mac/mac_test.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/mac/mac_top.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/new/mac/crc.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/rx/arp_rx.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/rx/ip_rx.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/rx/mac_rx.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/rx/mac_rx_top.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/rx/udp_rx.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/src/util_gmii_to_rgmii.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/tx/arp_tx.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/tx/ip_tx.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/tx/ip_tx_mode.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/tx/mac_tx.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/tx/mac_tx_mode.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/tx/mac_tx_top.v"
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/tx/udp_tx.v"
remove_design -verilog "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/new/mac/crc.v"
add_design C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/ipcore/pll_sft/pll_sft.idf
add_design C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/ipcore/i_8_4094_o_16_2048_fifo/i_8_4094_o_16_2048_fifo.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/ipcore/pre_trans_fifo/pre_trans_fifo.idf
add_design C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/ipcore/voice_cache_fifo/voice_cache_fifo.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
remove_fic "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/synthesize/hdmi_loop_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
add_fic "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/synthesize/hdmi_loop_syn.fic"
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module ms72xx_ctl
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/testbench/tb_voice_trans_cache.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_fic "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/synthesize/hdmi_loop_syn.fic"
add_fic "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/synthesize/hdmi_loop_syn.fic"
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/ipcore/data_buff_fifo/data_buff_fifo.idf
add_design "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/send_data_protocol.v"
remove_fic "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/synthesize/hdmi_loop_syn.fic"
add_fic "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/synthesize/last.fic"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/ipcore/i_8_4094_o_16_2048_fifo/i_8_4094_o_16_2048_fifo.idf
remove_design -force -verilog "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/voice_trans_cache.v"
remove_simulation "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/src/eth/testbench/tb_voice_trans_cache.v"
remove_design -force C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/ipcore/pre_trans_fifo/pre_trans_fifo.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
remove_fic "C:/Users/paihui/Desktop/video_pcie_trans/video_pice_tans_fpga/06_hdmi_loop/synthesize/last.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force C:/Users/smn90/repo/FPGA_atoms/pango_transplant/pcie_triple_trans/project.old/ipcore/voice_cache_fifo/voice_cache_fifo.idf
remove_design -force -verilog "C:/Users/smn90/repo/FPGA_atoms/pango_transplant/pcie_triple_trans/project.old/src/eth/camera_delay.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
