#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Wed Feb  8 18:52:29 2023

set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_rx_tx
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_rx_tx
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "C:/Users/w/Desktop/MES50HP/2_demo/07_hdmi_loop/src/hdmi_loop.fdc"
remove_constraint  -logic -fdc "C:/Users/w/Desktop/MES50HP/2_demo/07_hdmi_loop/src/hdmi_rx_tx.fdc"
add_design "C:/Users/w/Desktop/MES50HP/2_demo/07_hdmi_loop/src/hdmi_loop.v"
remove_design -verilog "C:/Users/w/Desktop/MES50HP/2_demo/07_hdmi_loop/src/hdmi_rx_tx.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design G:/BaiduNetdiskDownload/06_hdmi_loop/06_hdmi_loop/ipcore/pcie_trans/pcie_trans.idf
add_design G:/BaiduNetdiskDownload/06_hdmi_loop/06_hdmi_loop/ipcore/i_24_128_o_128/i_24_128_o_128.idf
remove_design G:/BaiduNetdiskDownload/06_hdmi_loop/06_hdmi_loop/ipcore/i_24_128_o_128/i_24_128_o_128.idf
add_design G:/BaiduNetdiskDownload/06_hdmi_loop/06_hdmi_loop/ipcore/i_16_128_o_128_16_fifo/i_16_128_o_128_16_fifo.idf
remove_design G:/BaiduNetdiskDownload/06_hdmi_loop/06_hdmi_loop/ipcore/i_16_128_o_128_16_fifo/i_16_128_o_128_16_fifo.idf
add_design G:/BaiduNetdiskDownload/06_hdmi_loop/06_hdmi_loop/ipcore/i_16_128_o_128_16/i_16_128_o_128_16.idf
add_design "G:/BaiduNetdiskDownload/06_hdmi_loop/06_hdmi_loop/src/dma_ctrl.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
add_fic "G:/BaiduNetdiskDownload/06_hdmi_loop/06_hdmi_loop/synthesize/hdmi_loop_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "C:/Users/smn90/repo/FPGA_atoms/pango_transplant/hdmi_pcie_trans/RTL/dma_ctrl.v"
add_design "C:/Users/smn90/repo/FPGA_atoms/pango_transplant/hdmi_pcie_trans/RTL/hdmi_loop.v"
add_design "C:/Users/smn90/repo/FPGA_atoms/pango_transplant/hdmi_pcie_trans/RTL/iic_dri.v"
add_design "C:/Users/smn90/repo/FPGA_atoms/pango_transplant/hdmi_pcie_trans/RTL/ms72xx_ctl.v"
add_design "C:/Users/smn90/repo/FPGA_atoms/pango_transplant/hdmi_pcie_trans/RTL/ms7200_ctl.v"
add_design "C:/Users/smn90/repo/FPGA_atoms/pango_transplant/hdmi_pcie_trans/RTL/ms7210_ctl.v"
add_constraint "C:/Users/smn90/repo/FPGA_atoms/pango_transplant/hdmi_pcie_trans/FPGA/video_pcie_trans.fdc"
remove_design -force -verilog "C:/Users/smn90/repo/FPGA_atoms/pango_transplant/hdmi_pcie_trans/project.old/main/src/iic_dri.v"
remove_design -force -verilog "C:/Users/smn90/repo/FPGA_atoms/pango_transplant/hdmi_pcie_trans/project.old/main/src/ms7210_ctl.v"
remove_design -force -verilog "C:/Users/smn90/repo/FPGA_atoms/pango_transplant/hdmi_pcie_trans/project.old/main/src/ms7200_ctl.v"
remove_design -force -verilog "C:/Users/smn90/repo/FPGA_atoms/pango_transplant/hdmi_pcie_trans/project.old/main/src/ms72xx_ctl.v"
remove_design -force -verilog "C:/Users/smn90/repo/FPGA_atoms/pango_transplant/hdmi_pcie_trans/project.old/main/src/hdmi_loop.v"
remove_design -force -verilog "C:/Users/smn90/repo/FPGA_atoms/pango_transplant/hdmi_pcie_trans/project.old/main/src/dma_ctrl.v"
remove_constraint -force -logic -fdc "C:/Users/smn90/repo/FPGA_atoms/pango_transplant/hdmi_pcie_trans/project.old/main/src/hdmi_loop.fdc"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -fsm_compiler {original} -top_module hdmi_loop
synthesize -dir {C:/pango/PDS_2021.4-SP2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
